import React from "react";
import { Box, Container, Typography, Grid } from "@mui/material";
import InfoSection from "../components/InfoSection";

const faqData = [
  {
    title: "1. Як зареєструватися на платформі?",
    content: [
      "Для реєстрації на нашій платформі перейдіть на сторінку вибору ролі, оберіть роль, натисніть 'Продовжити', Вас перекине на сторінку реєстрації, заповніть необхідні поля. Після цього буде відправлене повідомлення з пін-кодом на електронну пошту, Вам потрібно буде ввести його і після цього Ви будете зареєстровані.",
    ],
  },
  {
    title: "2. Як додати товар для продажу?",
    content: [
      "Для додавання товару, перш за все, Ви повинні бути продавцем, тобто бути зареєстрованим як продавець. Далі для продажу на платформі перейдіть у свій лоти та виберіть опцію 'Додати лот'. Далі слідуйте інструкціям та заповнюйте необхідні поля.",
    ],
  },
  {
    title: "3. Які способи оплати доступні на платформі?",
    content: [
      "На нашій платформі доступні різні способи оплати, такі як кредитні картки, платіжні системи, банківські перекази тощо. Ви можете обрати найзручніший для вас спосіб оплати під час оформлення замовлення.",
    ],
  },
  {
    title:
      "4. Як мені зв'язатися зі службою підтримки клієнтів, якщо у мене виникнуть питання?",
    content: [
      "Ви можете зв’язатися зі мною, надіславши електронний лист на contact@bid&win.com або зателефонувавши за нашим безкоштовним номером - +380987345632. Ми швидко Вам допоможемо.",
    ],
  },
  {
    title: "5. Чи можу я повернути товар, якщо він не відповідає вимогам?",
    content: [
      "Абсолютно! Ми пропонуємо безпроблемну політику повернення. Якщо Ви не повністю задоволені, ви можете повернути продукт протягом [кількості днів] днів для повного відшкодування або обміну.",
    ],
  },
];

const Faq = () => {
  return (
    <Box
      sx={{
        pt: { xs: 4, sm: 12 },
        pb: { xs: 8, sm: 16 },
        mt: 5,
      }}
    >
      <Container
        sx={{
          position: "relative",
          display: "flex",
          flexDirection: "column",
          alignItems: "center",
          gap: { xs: 3, sm: 6 },
        }}
      >
        <Typography variant="h3" component="h1" fontWeight={600} gutterBottom>
          Часті запитання
        </Typography>
        <Grid container spacing={4}>
          {faqData.map((faq, index) => (
            <Grid item xs={12} key={index}>
              <InfoSection title={faq.title} content={faq.content} />
            </Grid>
          ))}
        </Grid>
      </Container>
    </Box>
  );
};

export default Faq;
